In [1]:
# Импорт библиотек
import matplotlib.pyplot as plt
import pandas as pd
%matplotlib inline
import seaborn as sns
print("Setup Complete")
sns.set_palette("muted")
pd.plotting.register_matplotlib_converters()

Setup Complete

In [2]:
# Загрузка данных
titanic_filepath = "../train.csv"
titanic_data = pd.read_csv(titanic_filepath, index_col="PassengerId")

# Описание

### Основная информация
«Титаник» (англ. Titanic) — британский трансатлантический пароход, крупнейшее пассажирское судно в мировой истории в 1912—1913 годах. Во время первого рейса затонул в северной Атлантике, столкнувшись с айсбергом в ночь с 14 на 15 апреля 1912 года.

Каюты и общественные помещения «Титаника» разделялись на три класса.
«Титаник» отправился из Саутгемптона в Нью-Йорк, совершив остановки во французском Шербуре и ирландском Квинстауне.

### Словарь данных

|  Переменная | Определение  | Ключ  |
|:---|:---|:--|
| Survival  | Спасение | 0 - нет, 1 - да |
| Pclass    | Класс билета  | 1 - первый, 2 - второй, 3 - третий  |
| Sex | Пол | male - мужчина, female - женщина |
| Age | Возраст в годах |  |
| Sibsp | Супруг, братья и сестеры на борту корабля (в сумме) |  |
| Parch | Родители и дети на борту корабля (в сумме) |  |
| Ticket | Номер билета ||
| Fare | Стоимость билета ||
| Cabin | Номер кабины ||
| Embarked | Порт погрузки | C - Шербур, Q - Квинстаун, S - Саутгемптон|

# Оценка качества данных
Дублирующие записи и пропуски искажают статистические показатели датасета. Уточним, сколько записей в датасете, удалим дублирующие записи и обновим данные о размере данных:

In [3]:
print(titanic_data.shape)
titanic_data.drop_duplicates()
print(titanic_data.shape)

(100000, 11)
(100000, 11)

Размера датасета не изменился, следовательно, все записи нем уникальны. 

Проверим тип данных и количество записей для каждого признака в датасете:

In [4]:
titanic_data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 100000 entries, 0 to 99999
Data columns (total 11 columns):
 #   Column    Non-Null Count   Dtype
---  ------    --------------   -----
 0   Survived  100000 non-null  int64
 1   Pclass    100000 non-null  int64
 2   Name      100000 non-null  object
 3   Sex       100000 non-null  object
 4   Age       96708 non-null   float64
 5   SibSp     100000 non-null  int64
 6   Parch     100000 non-null  int64
 7   Ticket    95377 non-null   object
 8   Fare      99866 non-null   float64
 9   Cabin     32134 non-null   object
 10  Embarked  99750 non-null   object
dtypes: float64(2), int64(4), object(5)
memory usage: 9.2+ MB

### /////////выжившие + пкласс - категориальный признак?////////////
Все (остальные) типы данных признаков соответсвуют их описанию. 

В датасете присутствуют пропуски, рассчитаем в процетах насколько заполнен каждый признак:

In [5]:
titanic_data.isnull().mean() * 100 # Концентрация пропусков в процентах

Survived     0.000
Pclass       0.000
Name         0.000
Sex          0.000
Age          3.292
SibSp        0.000
Parch        0.000
Ticket       4.623
Fare         0.134
Cabin       67.866
Embarked     0.250
dtype: float64

Среди всех признаков слишком много пропусков оказалось в переменной "Cabin" - почти 68%, поэтому она подлежит удалению:

In [6]:
titanic_data = titanic_data.drop(columns=['Cabin'])
titanic_data

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked
PassengerId,,,,,,,,,,
0,1,1,"Oconnor, Frankie",male,NaN,2,0,209245,27.14,S
1,0,3,"Bryan, Drew",male,NaN,0,0,27323,13.35,S
2,0,3,"Owens, Kenneth",male,0.33,1,2,CA 457703,71.29,S
3,0,3,"Kramer, James",male,19.00,0,0,A. 10866,13.04,S
4,1,3,"Bond, Michael",male,25.00,0,0,427635,7.76,S
...,...,...,...,...,...,...,...,...,...,...
99995,1,2,"Bell, Adele",female,62.00,0,0,PC 15008,14.86,C
99996,0,2,"Brown, Herman",male,66.00,0,0,13273,11.15,S
99997,0,3,"Childress, Charles",male,37.00,0,0,NaN,9.95,S
99998,0,3,"Caughlin, Thomas",male,51.00,0,1,458654,30.92,S
99999,0,3,"Enciso, Tyler",male,55.00,0,0,458074,13.96,S

# Data exploration

# Summary